const formatTime = date => {
  const year = date.getFullYear()
  const month = date.getMonth() + 1
  const day = date.getDate()
  const hour = date.getHours()
  const minute = date.getMinutes()
  const second = date.getSeconds()

  return [year, month, day].map(formatNumber).join('/') + ' ' + [hour, minute, second].map(formatNumber).join(':')
}

const formatNumber = n => {
  n = n.toString()
  return n[1] ? n : '0' + n
}

const formatDis = (n) => {
  return n > 500 ? `${(n / 1000).toFixed(2)}公里` : `${n}米` 
}

const allLine = "B1,B3,K3,T7,T12,T21,T22,T24,T25,T27,T28,C131,C151,C223,C229,C240,C242,C244,C246,C251,C253,C256,C257,D195,D199,T12A,T203,测试2路,定制公交18号线,定制公交旅游2号线,1,2,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,37,38,39,40,41,43,44,45,46,47,48,49,50,51,52,53,56,57,59,60,61,62,63,64,65,66,68,70,72,76,78,80,81,97,99,101,102,103,104,105,106,107,108,109,110,111,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,143,145,146,147,148,149,150,152,154,155,156,157,158,159,161,162,163,166,226,232,233,234,235,300,301,302,303,304,305,399,501,502,503,504,505,506,507,508,509,510,512,513,516,517,518,519,521,522,525,526,527,528,529,530,531,532,535,536,537,538,539,702,703,704,705,706,707,708,709,710,801,803,804,805,901,902,903";

const allStation = "168新桥学校,327地质队,RFID-NZ,艾岗村,艾亭路公交站,安大北门,安大西门,安大新区,安大新区东门,安纺总厂,安高城市天地,安徽报社,安徽财贸学院,安徽电力修造厂,安徽工商学院,安徽合肥体育中心,安徽粮食学院,安徽名人馆,安徽轻工商城,安徽日报社,安徽涉外学院,安徽审计学院,安徽水电学院,安徽中医药大学,安居苑,安居苑东,安居苑西村,安凯集团,安农大,安庆路,安然绿洲花园,安医大二附院,安医附院,安医站,安医住院部,安职院,安职院南门,奥林花园,八佰户,八大户,八斗路,八公山路,八里岗,八中,巴黎春天,坝上街,白马巴士,白水坝,白水塘,白塘,百花大道,百花井,百思购广场,百丈路,柏仓房,柏树郢,柏堰工业园,柏堰公交站,柏堰枢纽站,柏堰站,板桥河,板桥河立交桥,半岛路,半个店,蚌天路口,蚌五小,包冲,包公像,包公学府,包公园,包桂路口,包河花园,包河区政府,包河苑,包河中学,包淮路口,包泉路口,包祥路口,宝塔,宝湾国际,报业园,北部湾路,北城办,北城核心区,北城世纪城,北城水岸人家,北城中学,北分路,北分路村,北分路回民小学,北份郢,北京路,北京西安路口,北李,北祁路口,北三十岗粮站,北庄停靠站,笔架山,碧桂园,碧水源,汴河路,滨河小区,滨湖城市天地,滨湖二小,滨湖公交站,滨湖国际花都,滨湖和园,滨湖会展中心,滨湖会展中心北门,滨湖会展中心东门,滨湖会展中心西,滨湖家园,滨湖建设指挥部,滨湖康园,滨湖前城,滨湖瑞园,滨湖润园,滨湖湿地公园,滨湖湿地公园西门,滨湖时代广场,滨湖时光小区,滨湖世纪城,滨湖寿春中学,滨湖顺园,滨湖万达公交站,滨湖望湖小学,滨湖欣园,滨湖学院,滨江花月,滨水街,亳州路,亳州路菜场,亳州路桥,博澳丽苑,博物馆,布水站,埠里社区,埠里卫生院停靠站,埠里中学,埠南社区,采和路口,采石苑,彩虹光伏,彩虹蓝光,彩虹路口,彩虹站,蔡冲,蔡岗,蚕种厂,仓房,藏洼,曹坊,曹坊路,曹谷堆,曹营街,漕冲糖酒城,草坎,草塘,茶壶山,柴油机厂,潺塘村,昌岭路口,长安村,长安萨尔斯堡花园,长白山公租房,长白山路,长垱村,长丰路桥,长岗公园,长岗连环新村,长沟埂,长广路口,长海路口,长恒路口,长虹工业园,长怀路口,长江饭店,长江批发市场,长江批发市场南,长乐,长临河公交站,长龙路口,长潜路口,长天路口,长岳路口,巢湖路公交站,巢站路口,朝东郢,朝西方,朝霞社区,朝阳村,车管所,车左,车左西岗,陈槽坊,陈祠村,陈祠小学停靠站,陈村南路,陈大村,陈大树,陈岗,陈夹弄,陈家洼,陈龙,陈龙村,陈桥,陈塘,陈湾,陈小郢,陈扎岗,晨风苑,成湖路口,呈坎,城关中学,城隍庙,城隍庙后街,城南新村,池郢,冲陈,滁河路公交站,滁州路,创新大道,创新公寓,创新路口,创新示范区,创燕路口,创业站,春融苑,祠堂郢,慈海路口,翠淝路口,翠澜站,翠庭园,翠微北区,翠竹园,撮镇,撮镇客运站,撮镇桥,撮镇镇政府,撮镇中心街,大柏店,大板桥,大陈,大地中学,大店,大店工业园,大东门,大方郢,大富绿洲,大观份,大郭村,大红村,大后份,大华国际港,大栗树,大连路,大连路东,大彭村,大铺头,大墙,大桥社区停靠站,大市场,大市场北门,大树郢,大通路小学,大圩,大圩镇政府,大西门,大兴商场,大兴塔陵,大兴镇,大学城,大杨南路,大杨小学,大杨窑厂,大杨镇,大姚岗,大窑村委会,大窑路口,大窑湾,大殷岗,大泽路,大张郢,大章,大钟楼,大钟楼北,大钟楼东,大众村,大众路,大众巷,戴店,戴岗,戴小郢,丹金路口,丹青花园,丹青路口,丹霞路,丹霞路东,丹霞西路,当铜路口,当涂北路,当涂路桥,当涂支路,道士岗,道寺岗,稻山路口,稻香村,稻香楼,邓大郢停靠站,邓小油坊,底下郢,地调院,地税局,电厂,电厂东路,电厂路,电焊机厂,电子工程学院,店岗,叠嶂路,丁岗,丁岗社居委,丁家桥,丁松棵,丁塘梗,丁糖梗,丁香家园,东庵街,东边许,东陈岗,东陈岗西,东城世家,东二十埠,东二十埠南,东方花园,东方花园北,东方蓝海,东方商城,东方医院,东淝路口,东岗,东冠小学,东和路口,东河,东怀路口,东瞿,东流路,东马路口,东七里站,东升,东圣路口,东石路口,东泰电力安装,东泰纺织,东湾,东王郢,东圩停靠站,东新路口,东新庄,东阳路口,东姚,东郢村,东园,东站社区,东至路,董岗,董岗停靠站,董铺水库,动漫基地,洞庐路口,洞天路口,斗镇,斗郑坎,窦桥湾,窦小郢,杜岗,杜老家,杜郢,渡江战役纪念馆,锻压厂,墩塘,多伦多花园,二里半,二里街,二十埠河,二十九中,二十一中,二水厂,繁昌路,繁翡路口,繁华大道,繁华新园,繁吉路口,繁九路口,繁龙路口,繁松路口,繁天路口,繁文路口,繁玉路口,繁云路口,繁祝路口,范大郢,范小郢,方大郢,方广路口,方莲路口,方桥社区,方桥新镇,方始路口,方兴社区,方兴园,方郢,飞凤街,飞虎路,飞虎路口,飞龙工业园,飞跃学校,非遗园,肥东二中,肥东公交客运站,肥东公交客运站北,肥东火车站,肥东交通汽修厂,肥东汽车站,肥东三中,肥东师范,肥东特教学校,肥东一中南门,肥光,肥光小学,肥光中学,肥西党校,肥西地税局,肥西火车站,肥西疾控中心,肥西建材大市场,肥西客运公司,肥西路,肥西三小,肥西三中,肥西县医院,肥西中学,淝河路桥,淝河停保场,淝河镇,淝南家园,淝铜路口,翡翠公园,翡翠湖,翡翠路,肺科医院,分路口,丰乐河路,丰乐生态园,丰祥郢,枫井路口,枫林路,枫香大道,凤嘉路口,凤临苑,凤麟兰庭,凤梅,凤台路,凤霞社区,凤阳东路,凤阳路菜场,凤羽,佛丹路口,佛耕路口,佛石路口,佛掌路,伏龙村,芙宝路口,芙叠路口,芙莲站,芙蓉路公交站,芙蓉社区,芙蓉西区,芙石路口,芙松路口,服务外包基地,浮山路,妇幼保健院,阜汲路口,阜南西路,阜阳路桥,复兴家园,复兴社区,富淮路口,富马庄园,富民村委会,馥邦广场,馥邦广场公交站,干休所,甘泉路,甘田路口,岗胡,岗集,岗集黄郢,岗集龙岗社区,岗集小学,岗集镇政府,岗南路,岗郢,钢北二村,钢北一村,港口徐,高凹子,高岗村,高河埂,高老家,高刘安置点,高刘客运站,高柳树,高升学校,高速时代城,高速时代广场,高塘湖路,高塘社区,高铁路,高王桥,高小郢,高新区管委会,格兰云天,格力工业园,格力公司,葛大店,葛维茂,葛小郢,根源光大,耕蓬路口,耕青路口,耕耘路,耕耘路东,工大北区,工大南区,工大西门,工业大道路口,工业经济学院,公交二公司,公交集团,公交技校,公交三公司,公交双墩站,公交四公司,公交五保场,供电局,共和花园,沟里停靠站,姑娘巷,古城村,古城社区,古堆村停靠站,古埂公园,古河相城路口,古井桥,谷大郢,鼓楼桥,固淮路口,固蒙路口,固西路口,固辛路口,固阳路口,固镇路,顾圩停靠站,关镇村,关镇佳园,关镇家园,观湖苑,观美社区,观音庙,官山路口,官塘,官亭林海,官亭农贸市场,官亭枢纽站,官亭医院,光荣院,广岩,广银铝业,贵池路,贵怀路口,贵潜路口,贵岳路口,桂花园,桂庄,国防科技大学,国防苑,国购广场,国际护理学院,国际汽车城,国家电子商务基地,国开公馆,国力砼公司,国强丰瑞园,国强钢材中心,国瑞印务,国祯大厦,海宝村委会,海宝集,海关路,海恒社区,海科路口,海棠花园,海棠街道办事处,海棠路,海棠小学,海阳,海洲景秀世家,韩北塘,韩冲,韩小郢,杭埠路,杭埠路口,杭菖路口,杭川路口,杭岗社区,杭贵路口,杭宁路口,毫州路,好华站,号塘,昊天园,浩圩村,合巢,合繁路口,合肥百大站,合肥北城高铁站,合肥财经学院,合肥昌河公司,合肥大剧院,合肥二建,合肥广电中心,合肥国际港,合肥惠科,合肥火车站,合肥建设学校,合肥建设学院,合肥经贸旅游学校,合肥科技馆,合肥科技学院,合肥南站,合肥南站北广场,合肥皮革城,合肥汽车站,合肥十中新区,合肥时尚皮革城,合肥时尚生活城,合肥四中（新区）,合肥同仁医院,合肥晚报社,合肥五建,合肥学院,合肥学院新区,合肥一中,合肥浙商城,合肥中菜市,合钢公司,合钢南门,合钢西门,合钢影院,合工大,合工大新区,合欢路,合欢站,合家福超市,合家福购物广场,合家福购物街,合科路口,合浦北村,合树棵,合铜路口,合裕路,何祠堂,何大郢,何小郢,和平公园,和平广场,和平广场南,和平花园,和顺花园,和顺站,和一花园,河坝头,河滨村,河东,河东村,河西停靠站,荷塘路,贺大郢,贺小郢,鹤阳路口,黑龙江路,黑树棵,恒大帝景,横杜村,横塘拐,横郢,衡成路口,衡南路口,衡山路口,红枫路,红枫站,红科路口,红旗建材市场,红十字会医院,红糖坎,红皖路,红樱桃工业园,宏龙路口,宏图中学,洪峰路,洪岗村,洪小郢,鸿路集团,侯郢,后蒋岗,后楼岗,后张,候店,候机楼,胡大郢,胡岗,胡李村,胡楼村停靠站,胡小坝,湖滨,湖滨楼,湖枫路口,湖万路口,湖雪路口,琥珀农行,琥珀山庄,琥珀邮局,互联网产业园,花岗村,花岗公交站,花木城,花木大市场,花神郢,花溪新村,花园,花园村路,花园大酒店,花园居委会,华邦世贸城,华东建材中心,华东文博城,华孚商业广场,华府商业广场,华光村,华联金寨店,华庙,华南城,华南路口,华夏茶博城,华夏旅游学校,华星钢构,华星智能,华亚防水公司,华中汽配城,化工厂,化工研究院,怀宁北路桥,怀宁路,怀宁路桥,怀习路口,淮北路公交站,淮合花园,淮合小学,淮南路口,环店路口,环东新村,环港东路,环湖家具城,皇嘉路,皇灵路口,皇马花园,黄藏峪路,黄祠坎,黄稻背,黄科路口,黄栗头,黄山大厦,黄圣路口,黄四岗,黄五村,黄巷,黄小郢,黄郢,黄岳路口,徽贵苑,徽杭路口,徽华路,徽嘉路口,徽杰苑,徽南路口,徽强路,徽商学院,徽商银行,徽园,徽云路口,徽中路,徽中路口,徽州大道,回龙庵,廻龙桥,汇林园小区,惠民,慧谷创业园,火车西站,火车站,火车站北广场,火车站西,霍岗,机场大门,机研所,汲桥路,疾控中心,集贤路,季大圩,季新庄,济民医院,夹背塘,夹哄,夹塘村,佳安建材,佳源巴黎都市,贾大郢,贾大郢村,贾小郢,贾小郢西,监管支队,建材三厂,建材一厂,建工学院,建工学院南区,建国迎宾馆,建华,建华新村,建设村,建设厅二招,建筑大学北区,建筑大学南区,建筑大学南区南门,江坝,江淮起重,江淮站,江汽厂,江郢,姜岗停靠站,姜坎,姜郢,将军岭社区,蒋沟埂,交通局,交通厅桥,焦岗,焦姥公园,焦小郢,界首路,金安花园,金庵,金坝,金坝村,金池路,金大塘,金丹路口,金店雅苑,金东路口,金斗公园,金峰路公交站,金凤站,金桂路口,金锦路口,金麟路,金麟站,金灵路口,金鸣街,金宁路口,金牛路,金瑞路口,金色池塘,金世路口,金泰建材城,金屯立交桥,金皖路,金仙路口,金休路口,金站路口,金珠路,锦佛路口,锦弘中学,锦蓬路口,锦绣大道,锦绣社区,锦绣紫云花园,进水闸,京商商贸城,经开区保养场,经开区停保场,旌湾,晶品苑,井岗,井岗村,井岗社区,井潭路口,井湾,井沿,警安驾校,警察培训学校,警察学院,静安新城,静安医院,九高,九华山路站,九连塘,九狮苑,九溪江南园,瞿塘,瞿小庄,军官培训中心,军休四所,军张堰,君豪路,开福路,开福路公交站,开福路口,开福寺,恺悦中学,康城站,康居时代家园,康乐路口,康利园,康瑞科技,康园小学,科大创新,科大东区,科技园,科三路口,科四路口,科学大道,科学分院,科学家园,科学院医院,可苑新村,客车厂,客运西站,客运总站,空启路口,孔岗小学,孔石桥,赖少其艺术馆,兰河路口,兰郡花园,兰州路,兰州宁夏路口,拦冲坝,蓝鲸大厦,蓝领公寓,蓝天酒店用品城,蓝田,郎溪路,郎溪路枢纽站,劳动村,老官塘,老管集,老家束,老四房,老窑,老郑郢,老周郢,乐曹路口,乐客来国际广场,乐客来商业中心,罍街,李城,李鸿章享堂,李老岗,李洼,李湾小区,李小郢,李郢,李元,立恒工业广场,利北路口,利民站,利辛路,栗树,连海路口,莲花路,莲花塘,联通公司,联庄停靠站,凉亭,梁郢,粮食三库,林大郢,林店,林张,临大路口,临港产业园,临湖老街,临湖社区,临湖祥园,临湖雅苑,临淮路,临泉西路公交站,临溪,临阳路口,临颖交口,临站路口,灵荷路口,灵石路,灵天路口,凌大塘,凌湖路,凌湾,菱湖公园,刘冲村,刘大塘,刘大郢,刘岗,刘合岗,刘厅村,刘团,刘洼,刘小郢,柳林大道,柳林大道西,柳树塘,柳树塘公交站,柳荫塘,六安路,六安路口,六安路小学,六斗背,六房村,六房郢,六家畈,六家畈北,六家畈南,六十八中,六十二中,六十九中,六十三中,龙东经贸,龙岗,龙岗水厂,龙岗停保场,龙河路,龙集,龙居山庄,龙门岭路,龙门寺示范园停靠站,龙栖地湿地公园,龙塘,龙湾,龙王村,龙王庙,龙颍路口,隆岗,楼西停靠站,庐川路口北,庐川路口东,庐川路口南,庐川路口西,庐福路口,庐江商会,庐州大道北,庐州卫校,庐州医院,芦岭路,炉桥路公交站,陆大村,陆集,陆军军官学院,陆郢,路大村,路西村,路西郢,旅游汽车站,铝厂,绿都花园,绿海商务学院,绿色港湾,绿水雅客,绿洲人家,氯碱公司,轮滑场,罗北新村,罗店,罗岗,罗集,罗集小学,罗家疃,罗家疃西,螺丝岗,骆岗机场,马道停靠站,马方村,马岗,马岗小学南区,马合公司,麦张岗,毛竹园,茅铺,茂林路,梅冲,梅冲支路,梅兰,梅寿二,梅小店,煤气制气厂,煤炭设计院,美丹,美和路,美佳橱柜,美景人家,美菱包装公司,美菱华星钢构,美菱小学,美容美发用品城,美圣路,美圣站,濛河路口,濛兴路口,蒙城路桥,蒙城路桥东,孟老家,梦溪小城,梦溪小城西,梦园小区,棉麻公司,庙岗,庙郢,民航宿舍,民生小学,民政大厦,民主党派办公楼,名流健康中心,明发商业广场,明发站,明光路汽车站,明杭路口,明华,明顺路口,明宿路口,明通路口,明星学校,明星学院,明月东一酒店,明珠产业园,明珠广场,明珠广场北,明珠广场东,明珠路,明珠码头,明珠站,铭创路口,铭花路口,磨店,磨店乡政府,磨坊郢,牡丹园,南岗村,南岗头,南岗中学,南高庄,南国花园,南湖春城,南湖路口,南丽湾,南陵,南庐路口,南门换乘中心,南门小学分校,南七里站,南三十岗,南四十埠,南圩社区停靠站,南新庄,南熏门桥,南艳湖,南园新村,聂郢,宁国路,宁国路菜场,宁水路口,宁屯路口,宁西路口,宁溪学校,农场,农耕园,农机大市场,农科院,农西郭,农业示范园,女教所,欧力产业园,藕塘村,藕塘站,排头,排头村,排头社区,派河大桥,盘塘,庞书房,炮兵防空兵学院东,炮院靶场,裴大郢停靠站,彭大郢,彭大郢东,彭岗,蓬丹路口,蓬莱花园,蓬莱路,蓬莱路公交站,蓬莱路口,淠河路,平塘王工业园,平塘站,蒲塘,七公里,七里河,七里桥,七里塘,七里塘镇,七中新区,祁呈路口,祁怀路口,祁门路东,祁圣路口,齐夏路口,祺瑞大厦,汽车东站,汽车工业学校,汽车客运西站,汽车客运西站南,前份,前江郢,前头郢,前新庄,前郢,前张,钱大郢,钱集农贸市场停靠站,钱集卫生院,钱小店,钱郢,桥冲,桥田岗,桥头集,桥湾村,秦岗停靠站,勤劳社区,勤劳小学,沁源路公交站,青春市场,青翠路公交站,青丹路口,青淝路口,青峰岭,青峰岭村委会,青峰岭官塘小学,青耕路口,青锦路口,青龙,青龙桥,青龙潭公租房,青龙潭路口,青鸾路,青鸾路口,青年北路,青年电商园,青年路口,青年塘,青年塘北,青年塘东,青年塘西,青史站,青汤路口,青阳路,青禹路口,轻机厂,清河路口,清怀路口,清锦路口,清水冲,清潭路,清潭站,清汤路口,清溪路,庆平学校,秋菊路,群英,染坊郢,人和科技园,人民坝,人民大街,荣城花园,荣凤苑,荣钱路口,容成路,容九路口,融科梧桐里,阮小郢,软件园,瑞景兰庭,三岔路口,三岗中心村,三国城遗址公园,三国遗址公园,三角线,三口塘,三里庵,三里街,三联学院,三联学院分校,三青,三十八所,三十八中,三十八中和平校区,三十埠,三十埠北,三十埠东,三十埠南,三十埠桥,三十埠西,三十埠中学,三十二中,三十六中,三十庙,三十四中,三十头,三十头乡政府,三十头小学,三十头医院,三十五中,三十中,三水厂,三西,三小郢,三孝口,三孝口东,三孝口西,三元开发区,三张郢,三张郢北,三中,森林城朗庭,筛箩岗,山北站,山后店,山湖路,山口,山王村,商之都,上冲,上海路,上何岗,上派中心学校,上三路口,上太路口,上王村,上王郢,上小路口,上张岗,尚店,尚真小学,少荃家园,邵大郢,邵小郢停靠站,邵庄,深港产业园,神行太保武校,沈槽坊,沈大坝,沈岗,沈海路口,沈河,沈塘,沈湾,生态公园,胜岗路口,胜利北路,胜利广场,胜利路立交桥,胜明路口,省城建设计总院,省第二人民医院,省第二人民医院黄山路院区,省电力公司,省电力设计院,省电力修造厂,省电气学校,省儿童医院,省肺科医院,省广电中心,省接待车队,省立儿童医院,省立医院,省立医院南区,省立医院南区东,省旅游学校,省农机校,省皮肤病防治所,省人大,省体育场,省体院,省行政中心,省胸科医院,省医科大新区,省政协,省中医院,省肿瘤医院,省种子公司,圣泉中学,圣休路口,盛达站,盛大村,盛大社区,盛岗头,盛嘉欧园,盛唐,师范附小,十八岗,十八岗村,十九村,十里店,十里庙,十里庙东,十六所,十七中,十七中南区,十三里庙,十五里河,十一中,十张村,石大郢,石集社区,石门路,石门路东,石松路口,石笋路公交站,石笋松林路口,石塘路,石油库,史城,史岗村,史小郢,始宿路口,始云路口,始朱,始紫路口,世纪城购物中心,世纪东路,世纪西路,世纪阳光花园,市城建医院,市第四人民医院,市二院,市二院新区,市府广场,市府三宿舍,市口腔医院,市六院,市苗圃,市群文活动中心,市人民医院,市三院,市图书馆,市委党校,市五院,市一院,市政务办公区,市政务办公区北,市政务办公区东,市政务办公区停靠站,市政务办公区西,市中院,寿春路,寿蜀园管委会,书房岗,书香门第,梳背桥,舒大郢,蜀井路口,蜀兰庭院,蜀鹿,蜀麓,蜀南庭苑,蜀南庭院,蜀山产业园,蜀山公园管理处,蜀山管理处,蜀山监狱,蜀山森林公园,蜀山西,曙光新村,曙光影院,树塘,树郢,双东路口,双墩,双墩公交站,双墩股份公司,双墩小学,双墩新集村委会,双墩邮局,双墩镇,双墩中学,双凤大桥,双凤管委会,双凤医院,双岗北,双岗东,双岗南,双岗西,双河村,双井,双龙,双龙大酒店,双庙村委会,水东路,水阳江路,顺和家园,四顶,四顶山森林公园,四方集团,四方路口,四河村,四里河,四牌楼,四十八中,四十八中南校区,四十埠居委会,四十埠社区,四十六中,四十六中南校区,四十铺,四十五中分校,泗淝路口,泗龙路口,泗陶路口,泗铜路口,泗禹路口,松繁路口,松谷路,松棵,松林,松树湾,松雨路,松雨站,松芝万象城,宋村,宋东站,宋家郢,宋小圩,苏桥,宿黄路口,宿松路,宿望路口,宿州路桥,濉溪路桥,孙大郢,孙岗,孙柳村,孙柳树,孙小郢,太和路,太湖路西,太汲路口,太宁路口,太平村,泰山路,谭冲路,潭冲河湿地公园,潭冲路,探矿厂,汤店,汤都路口,汤恒路口,汤口路,汤莲路口,汤桃路口,汤天路口,汤小庄,汤玉路口,唐大楼,唐家岗,唐杨桥,唐郢,棠溪人家,塘拐,塘西河公园,桃花村,桃花店,桃花工业园,桃花社区,桃花源,桃花镇政府,桃锦路口,桃山村委会,桃山周场新村,桃园,桃源路,桃源路口,陶楼北,陶楼古城社区,陶楼南停靠站,陶楼社区,陶楼桃花源,陶楼新丰广场,陶楼中学,陶南岗停靠站,陶西新村,陶新村委会停靠站,体育场,体育学院,天波路,天波路口,天长路公交站,天都路,天都路口,天鹅湖路,天鹅湖畔小区,天方路口,天海路,天海路口,天河路,天湖路,天津路,天锦路,天锦路口,天九路口,天科路口,天山公园,天山路口,天水路口,天汤路口,天卧路口,天星医药,天一出租公司,天竹路,天柱路,天柱山大道,天紫路口,铁路学校,铁四局,停靠站,通机所,同和民康小区,同桥,桐城北路,桐城路,桐江饭店,铜江路口,铜陵路桥,铜陵新村,铜天路口,涂郢古楼大桥,涂郢粮站,涂郢窑厂,屯溪路,沱河路,瓦岗,瓦岗停靠点,瓦屋郢,瓦屋站,瓦屋庄,外经大厦,湾塘面停靠站,皖都徽韵,皖江厂,皖江路,万安大道,万达乐园,万达文旅城,万大郢,万岗路,万胡村,万湖路口,万井路口,万科森林公园,万里村,万宁路口,万天路口,万泽路,汪岗,汪楼村,汪庙,汪塘,汪庄,王漕坊,王大郢,王道郢,王底,王敦,王墩,王岗,王岗北,王岗村,王岗东,王岗路公交站,王岗西,王拐,王拐岗,王九大郢,王咀,王老家,王面郢,王桥,王卫,王卫庄,王下份,王小郢,王小郢污水厂,王郢,王油坊,望呈路口,望城店,望桂路口,望湖北路,望湖城,望湖城地铁站,望湖南路,望湖西路,望湖中路,望科路口,望龙学校,望宁路口,望塘,望塘村,望铜路口,望岳路口,望智路口,为民中学,韦厂岗,韦小郢,韦郢,纬一路口,卫材总厂,卫岗,卫楼,卫塘,卫田村,卫田庄,卫乡,卫乡北,卫星社区,卫庄,蔚蓝商务港,魏武大道,文昌新村,文达学院,文锦新城,文明站,文天路口,文忠苑,汶雪路口,卧莲路口,卧龙山,卧龙山社区,卧松路口,卧云路公交站,卧云小区,邬洼,邬郢,巫坎,吴大郢,吴店社区,吴店小学停靠站,吴夹弄,吴老家,吴山,吴山首府,吴山镇政府,吴涂路口,吴王大道,吴王遗踪,吴巷,吴小店,吴小郢,吴小郢南,吴炎路口,吴郢社区,芜湖路,五里冲,五里村,五里墩,五里岗,五里拐,五里井,五里庙,五里庙装饰世界,五里洼,五十埠,五十墩,五十四中,五十中,五一小学,五爪塘,武贵路口,武警医院,物华苑,物价学校,物流路口,焐坊郢,夕阳红老年城,西背,西成路口,西大塘坎,西岗,西葛社区停靠站,西贵路口,西环中心广场,西嘉路口,西门换乘中心,西南国际车城,西山路口,西史岗,西王郢,西新庄,西郢,西云路口,习锦路口,习贤路口,习友村,下白户,下崔岗,下分许,下公岗,下龙岗,下塘公交站,下塘农药厂,下塘新集村,下塘中学,下万,下卫,下郢,下张岗,下周,下庄停靠站,夏大郢,夏店,夏郢,夏园路,仙翡路口,仙井,仙霞路,县地税局,县医院,县医院门诊,香江站,香径站,香樱路口,香樟大道,香樟花园,香樟站,祥和路,响井路口,项郢,橡树湾,消防队,消防巷,逍遥津,小柏村,小北郢停靠站,小藏郢,小东庵,小东门,小高炉,小韩村,小花塘,小花园,小黄村,小姜,小康村停靠站,小刘小郢,小马郢,小庙,小庙镇卫生院,小桥坎,小青阳,小蜀山,小魏庄,小新庄,小宣,小余岗,小朱岗,小竹墩,晓郭,晓星集,晓珠,孝肃桥,谢岗,谢岗村,谢老庄,澥河路,澥河路东,澥铜路口,心悦城,新城花园,新大桥,新大郢,新店,新段坎,新风林,新海公园,新海家园,新河村公交站,新华,新华电脑学校,新华电脑学院,新华国际广场,新华街,新华学府春天,新华学院,新华印刷公司,新环路口,新慧金水岸,新加坡花园,新加坡花园城,新街,新年新村,新桥产业园,新桥公交站,新塘咀,新祥路口,新亚汽车站,新站工业园,新庄,鑫昊站,信旺华府骏苑,兴海苑,兴华苑,兴华苑东,兴淮西路,兴岭村委会,兴隆,兴鹏学校,兴泰广场,兴塘,兴园,兴园小区,星火保险柜厂,星火钢制家具,星火工业区,星火站,星月出租公司,行知学校,杏花村,杏花公园,杏花公园北,杏花印务,杏林小区,幸福村,幸福大街,熊瞿,秀水花园,徐大卫,徐底下,徐桥,徐小郢,许岗,许岗村,许洼,许小河,许郢,旭光,宣岗,宣四方,宣小郢,薛河,学二路口,学府路,学林路,学林路东,学梅路口,学院路,雪霁路,循环经济院,鸭林冲,烟墩,烟墩镇政府,延安路,延安路东,延北路口,延海路口,延河路口,沿河村,沿河路桥,阳光半岛,杨岗,杨桂塘,杨桂塘市场,杨老岗,杨郢,仰光,养鸡场,姚曹坊,姚大郢,姚公庙,姚花庙,姚庙,瑶东社区,瑶海工业园,瑶海公园,瑶海家具大市场,瑶海家具世界,瑶海科技园,瑶海停保场,瑶海万达广场,要素大市场东,要素大市场南,要素大市场西,野生动物园,叶祠村,一号路东,一号路西,一里井,一零五医院,一六八中学,一六八中学东校,一中,医科大,医药产业园,仪表厂,颐和桂苑小学,颐和佳苑小学,义城,义城老街,义城农贸市场,义城小学,义和尚真中学,义界路口,义蒙路口,义兴,义兴中心小学,义颍路口,义颖交口,义颖路口,亿力机械,银河公园,银河湾,银科交口,银科路口,银杏路,银杏苑南区,英山林场,樱花路,颍河路口,颖河路口,颖武路口,永和家园,永和路,永良购物广场,油墩,油墩头,油坊岗飞龙工业区,油坊岗社居委,油坊岗社区,油坊铺,油坊新城,游艇码头,幼儿师范,于湾,余老庄,余小郢,余郢,鱼花池,榆梓坎,雨花桥,禹洲中央城,玉兰新村,玉屏路口,玉石山路,玉竹路,育才路口,御景前城,裕丰花市,裕隆大市场,裕铜路口,元一高尔夫,元一时代广场,原创雅苑,原山公馆,袁中,源芳,院塘,岳大郢,岳贵路口,岳西路,岳西路口,跃进村,云谷路,云广路口,云贵路口,云外路,云西路口,云玉路口,运管处,运输公司,枣林岗,枣庙,詹岗,占夹弄,站北路,站北社居委,站北文化广场,站前广场,站前路,站全路口,站塘,张槽坊,张大慎,张大郢,张岗,张华三,张集路,张夹弄,张庙,张磨坊,张团,张洼,张洼停保场,张湾,张圩子,张下,张巷,张小郢,赵祠村,赵大郢,赵巷,赵庄,赵庄停靠站,照山新村,珍珠路,振徽苑,振汶路口,振新路,振兴路,镇西路口,郑大郢,郑河,郑小洼,郑庄停靠站,政法干校,芝麻洼,职教城枢纽站,职教路,植物园,中广路口,中国科技大学,中国通用院,中昊建设,中环城,中加学校,中科大先研院,中科院肿瘤医院,中绿广场,中庙公交站,中山路站,中试基地,中松路口,中铁二十四局,中铁旭园,中湾,中心大市场,中心校西校区,周冲村,周岗,周谷堆,周山洼,周湾,轴承厂,朱大郢,朱高村,朱楼新农村停靠站,朱砖井,珠光村,竹丝滩,竹西村,竹西墩,竹园,庄坊,紫翡路口,紫合路口,紫金路口,紫荆名都,紫莲路口,紫庐路口,紫蓬工业园,紫蓬路,紫蓬山,紫青路口,紫云路,紫云路口,自行车厂,总参干休所,邹大郢,尊贵电器";

var GPS = {
  PI: 3.14159265358979324,
  x_pi: 3.14159265358979324 * 3000.0 / 180.0,
  delta: function (lat, lon) {
    // Krasovsky 1940
    //
    // a = 6378245.0, 1/f = 298.3
    // b = a * (1 - f)
    // ee = (a^2 - b^2) / a^2;
    var a = 6378245.0; //  a: 卫星椭球坐标投影到平面地图坐标系的投影因子。
    var ee = 0.00669342162296594323; //  ee: 椭球的偏心率。
    var dLat = this.transformLat(lon - 105.0, lat - 30.0);
    var dLon = this.transformLon(lon - 105.0, lat - 30.0);
    var radLat = lat / 180.0 * this.PI;
    var magic = Math.sin(radLat);
    magic = 1 - ee * magic * magic;
    var sqrtMagic = Math.sqrt(magic);
    dLat = (dLat * 180.0) / ((a * (1 - ee)) / (magic * sqrtMagic) * this.PI);
    dLon = (dLon * 180.0) / (a / sqrtMagic * Math.cos(radLat) * this.PI);
    return { 'lat': dLat, 'lon': dLon };
  },

  //WGS-84 to GCJ-02
  gcj_encrypt: function (wgsLat, wgsLon) {
    if (this.outOfChina(wgsLat, wgsLon))
      return { 'lat': wgsLat, 'lon': wgsLon };

    var d = this.delta(wgsLat, wgsLon);
    return { 'lat': wgsLat + d.lat, 'lon': wgsLon + d.lon };
  },
  outOfChina: function (lat, lon) {
    if (lon < 72.004 || lon > 137.8347)
      return true;
    if (lat < 0.8293 || lat > 55.8271)
      return true;
    return false;
  },
  transformLat: function (x, y) {
    var ret = -100.0 + 2.0 * x + 3.0 * y + 0.2 * y * y + 0.1 * x * y + 0.2 * Math.sqrt(Math.abs(x));
    ret += (20.0 * Math.sin(6.0 * x * this.PI) + 20.0 * Math.sin(2.0 * x * this.PI)) * 2.0 / 3.0;
    ret += (20.0 * Math.sin(y * this.PI) + 40.0 * Math.sin(y / 3.0 * this.PI)) * 2.0 / 3.0;
    ret += (160.0 * Math.sin(y / 12.0 * this.PI) + 320 * Math.sin(y * this.PI / 30.0)) * 2.0 / 3.0;
    return ret;
  },
  transformLon: function (x, y) {
    var ret = 300.0 + x + 2.0 * y + 0.1 * x * x + 0.1 * x * y + 0.1 * Math.sqrt(Math.abs(x));
    ret += (20.0 * Math.sin(6.0 * x * this.PI) + 20.0 * Math.sin(2.0 * x * this.PI)) * 2.0 / 3.0;
    ret += (20.0 * Math.sin(x * this.PI) + 40.0 * Math.sin(x / 3.0 * this.PI)) * 2.0 / 3.0;
    ret += (150.0 * Math.sin(x / 12.0 * this.PI) + 300.0 * Math.sin(x / 30.0 * this.PI)) * 2.0 / 3.0;
    return ret;
  }
}

module.exports = {
  formatTime: formatTime,
  formatDis: formatDis,
  allLine: allLine,
  allStation: allStation,
  GPS: GPS
}
